[
    {
        "image": ".\/pages\/public\/img\/vc.jpg",
        "name": "Prof Prateek Sharma",
        "class": "1989",
        "text": "DTU Class of 1989, Civil Engineering",
        "branch": "Civil Engineering ",
        "serial": "1"
    },
    {
        "serial": "2",
        "branch": "",
        "name": "Durga Das Aggarwal",
        "class": "1968",
        "text": "Dr. Durga an alumnus of University of Houston and long time resident, known for giving back to community. The USD 51-million building, which opened in 2017, had earlier named a floor after the couple. The Durga D and Sushila Agrawal Engineering Research Building has been named to recognise a transformational gift that the Agrawals have made, an university release said. Having immigrated to Houston in 1968 after his Bachelor's Degree in Mechanical Engineering from Delhi College of Engineering, Agrawal earned two advanced degrees in Industrial Engineering from the University of Houston's (UH) Cullen College of Engineering.   Dr.Durga D Agrawal, 74, who is from a  village in Madhya Pradesh's Lakhanpur, expressed his admiration and respect for his professors at the university, who put their heart and soul into teaching students. Dr. Durga started his piping technology and products company in 1975. Today, the company is a leading player in its category and employs over a 1,000 people. He was the first major donor and founding president of India House, a community centre that offers free services and community programs. Being the founder and first president of the Indo-American Chamber of Commerce of Greater Houston, Agrawal has been part of many delegations to promote trade and exchange of educational and medical resources between Houston and India.",
        "image": ".\/pages\/public\/img\/alumni and donor photos\/Dr. Durga Das Agrawal.jpg"
    },
    {
        "serial": "3",
        "name": "Rajesh K. Soin",
        "class": "1969",
        "branch": "Electrical Engineering",
        "text": "Indian American philanthropist Dr. Rajesh K Soin (alumnus 1969 batch of Mechanical Engineering) donated 5 crores for proposed multipurpose building at Delhi Technological University. The University administration decided to name proposed building Raj Soin Hall. This is the first time in the history of DCE-DTU that alumnus has donated this large sum. Dr. Soin graduated from Delhi College of Engineering in 1969 ( DTU now) gone to USA for further studies. In 1984, he and his wife Indu established Modern Technologies Corporation ( MTC ),  a consulting in engineering, management and technical services for U.S  Defence Department. MTC quickly become one of the fastest growing companies in United States named by Inc. magazine and became largest defence contractor in Ohio, before it was acquired in 2008. In 1998, he started Soin International, a holding company with many subsidiaries.<br><br>Dr. Soin believes in entrepreneur spirit, wants to grow, to accomplish his vision, Soin International act as incubator for new business ideas, and has invested considerably for more than 2 decades.  He and his family is involved with various charities, and contributed towards building hospitals and research centres in India and USA.<br>Dr. Soin was the founding trustee and first president of Ohio-India Project and was the recipient of Elllis Island Medal of Honor for his contribution as a mentor, charitable work and exceptional leadership.",
        "image": ".\/pages\/public\/img\/alumni and donor photos\/Rajesh K. Soin.jpg"
    },
    {
        "serial": "4",
        "name": "Dharendra Yogi Goswami",
        "class": "1969",
        "branch": "Mechanical Engineering",
        "text": "Dharendra Yogi Goswami (born May 15, 1948) is an Indian inventor, entrepreneur, author, and educator. He has few times advised the US Congress on energy policy and the transition to renewable energy. Goswami is a Distinguished Professor and the director of the Clean Energy Research Center at the University of South Florida. He is the emeritus editor-in-chief of the journal Solar Energy and has published more than 400 peer-reviewed articles and a number of books and book chapters.  He is also the inventor of the Goswami thermodynamic cycle.  His inventions have been commercialised and in 2016 Goswami was inducted into the Florida Inventors Hall of Fame.  He co-founded Molekule, which markets an air purifier.",
        "image": ".\/pages\/public\/img\/alumni and donor photos\/Dharendra Yogi Goswami.jpg"
    },
    {
        "serial": "5",
        "name": "Vinod Dham",
        "class": "1971",
        "branch": "Electrical Engineering",
        "text": "Popularly acclaimed worldwide as the Father of Pentium, for leading Intel's iconic microprocessor brand from inception to its worldwide success, Vinod Dham has Over 40+ years of experience in developing semiconductor products, technologies and Venture Capital.<br>Recently he has been involved in mentoring start-up entrepreneurs, as an Angel Investor. Earlier he was one of the handful of pioneers who brought Venture Capital and Start-up eco-system to India. He is a founder of IndoUS Venture Partners (IUVP), an India focused early stage venture capital fund.<br>Earlier, he was Chief Executive Officer of Silicon Spice, a chip design start-up he joined at its nascent stage and led the design of a VOIP chip. Silicon Spice was acquired by Broadcom for $1.2 billion. Prior to that he was Chief Operating Officer at NexGen, a microprocessor design start-up, which was acquired by AMD for $800m.<br>Prior to his start-up stints, he was Intel's Vice President of Pentium Processor Division and earlier General Manager of i486 Workgroup Computing Division. During his 16 years at Intel, he successfully led and managed - Intel 386 compaction, i486, and the Pentium Processor families, helping Intel become the largest company in the semiconductor Industry. During his initial years at Intel, he worked on Intel’s Non-Volatile memory technology and was a co-inventor of Intel's electrically alterable memory cell.<br>He has received numerous recognitions over the years. In the past he was named as one of the top 25 executives in the computer industry and one of the top 100 most influential Asian Americans.Recently he has been highlighted amongst the Indian Americans who have helped shape America, at the storied Smithsonian in Washington DC.",
        "image": ".\/pages\/public\/img\/alumni and donor photos\/Vinod Dham.jpg"
    },
    {
        "serial": "6",
        "name": "Karnal Singh",
        "class": "1979",
        "branch": "Mechanical Engineering",
        "text": "Karnal Singh is the driving force behind the dispute resolution practice at Circle of Counsels. He specializes in advising clients and formulating intricate strategies for some of the most complex and challenging litigations in the country. He is an ex-IPS officer who retired as the Chief of the Enforcement Directorate where he dealt extensively with investigations pertaining to white-collar crimes. He advises clients, on anti-money laundering, anti-corruption, frauds, compliance, economic crime defense, issues related to cryptocurrency & blockchain technology, cyber-crime, and investigations.<br>With over three decades of distinguished years of experience being an IPS officer, Karnal has extensive knowledge of governance, anti-money laundering investigations, foreign exchange regulation, and criminal investigations. His long tenure as a decorated IPS officer has been commended by the government with distinguished medals like President Police Medal for Distinguished Service in 2008, President Police Medal for Meritorious Service in 2002 and Satyendra K. Dubey Memorial Award in 2021 which was given by IIT Kanpur to recognize his exemplary service to humanity while serving as an IPS officer.<br>During his tenure as the Director of the Enforcement Directorate, he also held an additional charge as Director of the Financial Investigation Unit of India (FIU) and contributed to the preparation of the draft Fugitive Economic Offenders Act. Karnal also represented the Government of India before the Financial Action Task Force and Interpol. He led investigations under the Prevention of Money Laundering Act relating to the 2G scam, Vijay Mallya, Nirav Modi, Bank of Baroda, Augusta Westland, Panama paper leaks, bank frauds, coal blocks, and iron ore, and cases under Foreign Exchange Management Act (FEMA). Karnal Singh also led the Special Cell of Delhi Police which cracked several terrorism cases during his leadership.",
        "image": ".\/pages\/public\/img\/alumni and donor photos\/Karnal Singh.jpg"
    },
    {
        "serial": "7",
        "name": "Vijay Shekhar Sharma",
        "class": "1998",
        "branch": "Electrical Engineering",
        "text": "Founder and chief executive officer of one of the top-notch financial technology companies, Paytm, Shri Vijay Shekhar Sharma is an Indian billionaire businessman. He was ranked as India's youngest billionaire in 2017 by Forbes with a net worth of $1.3 billion. He was in the list of Time Maganize's 100 most influential people in 2017 and was awarded the 'ET Entrepreneur of the Year' by the Economic Times in 2016. He is considered a youth icon among startup aspirants.<br>His organization Paytm has signed MoU with DTU to establish the testing and training facilities for the centre of excellence for electric vehicles and related technologies. Another MoU with DTU has been signed to support for creating a Lab on Wheel facilities for digital literacy in rural area of NCT. They will also assist in onboarding Environmental Engineering department of DTU as an academic partner of Clean Air Project of UNEP.",
        "image": ".\/pages\/public\/img\/alumni and donor photos\/Vijay Shekhar Sharma.jpg"
    },
    {
        "image": ".\/pages\/public\/img\/alumni and donor photos\/Goswami Brothers Alumni Gold Medal.jpg",
        "name": "Goswami Brothers",
        "class": "1959-77",
        "text": "",
        "branch": "Textile, Mechanical, Chemical Engineering",
        "serial": "8"
    },
    {
        "serial": "9",
        "branch": "",
        "name": "Mahesh Joshi",
        "class": "1982",
        "text": "",
        "image": ".\/pages\/public\/img\/alumni and donor photos\/Mahesh Joshi.jpg"
    },
    {
        "serial": "10",
        "branch": "",
        "name": "Promod Haque",
        "class": "1969",
        "text": "Throughout his 32 years of experience in the VC industry, Promod has invested in more than 60 companies, which have produced more than $40B in exit values to date. In 2014, Forbes recognized Promod as a “Hall of Fame” investor. 2015 marked Promod’s eleventh appearance on the Forbes Midas List, including 2004, when he was ranked the #1 venture capitalist based on performance over the previous decade.<br>Recent liquidity events in Promod’s portfolio include Shape Security acquired by F-5 Networks , Health Catalyst - HCAT- IPO , cyber security leader FireEye (Nasdaq: FEYE); high fidelity imagery and infinite analytics company Skybox Imaging, acquired by Google for $500 million; and API management leader Apigee (Nasdaq: APIC)- acquired by Google. In addition, NTT Communications recently acquired Virtela, a company where Promod was the founding investor and Chairman of the Board, for $525 million.<br>Promod received a bachelor of science degree in electrical engineering from the University of Delhi, India. He holds a Ph.D. in electrical engineering from Northwestern University and an MBA from Northwestern’s Kellogg Graduate School of Management, where he serves on the advisory board.",
        "image": ".\/pages\/public\/img\/alumni and donor photos\/Promod Haque.jpg"
    },
    {
        "serial": "11",
        "branch": "",
        "name": "Dinesh Bhatia",
        "class": "1989",
        "text": "Mr. Dinesh Bhatia assumed the charge of Consul General of India, Toronto on 9 March 2016. He joined Indian Foreign Service in 1992. He speaks Hindi, English, Spanish, Punjabi and Multani. Prior to joining in the current post, Mr. Dinesh Bhatia was Ambassador Extraordinary and Plenipotentiary of India to Cote d’Ivoire, Guinea and Liberia with residence in Abidjan.<br>During his diplomatic career, Mr. Dinesh Bhatia has served in various specialized jobs in the Ministry of External Affairs, New Delhi. He served as Head of Multilateral Economic Division; as Director in Latin America and Caribbean Division, External Publicity Division and Foreign Service Institute; and as Deputy Secretary dealing with Bhutan.<br>Mr. Dinesh Bhatia has served in various Indian Missions abroad including Madrid, Spain; Kathmandu, Nepal; and Kuwait. He was seconded by the Government of India to Department of Atomic Energy, Mumbai and as Private Secretary to Tourism Minister of India.<br>Mr. Dinesh Bhatia is an alumnus of National Defence College. He also participated in the 4th Joint Civil Military Course on National Security at LBSNAA, Mussoorie. As an IFS Probationer, he was trained at LBSNAA, Mussoorie and Foreign Service Institute, New Delhi. He also authored “Physics for Civil Services Preliminary Examination” published by MnM Series.<br>Mr. Dinesh Bhatia obtained Bachelor of Engineering from Delhi College of Engineering with specialization in Electronics and Communication in 1989. Before joining the Indian Foreign Service, he worked in private sector – Tata Telecom and Unitel Communications.",
        "image": ".\/pages\/public\/img\/alumni and donor photos\/Dinesh Bhatia.jpg"
    },
    
    {
        "serial": "12",
        "branch": "",
        "name": "Ganesh Krishna",
        "class": "1982",
        "text": "Ganesh Krishnan is an angel investor, serial entrepreneur and promoter from India. His interests are startups and products from the areas of Consumer Internet, Healthcare, Education and Technology. He is currently the director of GrowthStory, an entrepreneurship platform that promotes greenfield ventures, working with marquee VCs and entrepreneurs. He is also the promoter director of startups like BigBasket.com, Bluestone, Portea Medical, HomeLane, HouseJoy, FreshMenu, HungerBox, ClearOut.io, Verloop.io, Marketics, KVN Foundation, FeedMyBangalore etc. He has previously founded an Edu-Tech startup called TutorVista which was later acquired by Pearson. He is an Adjunct Professor at Indian Institute of Management , Bangalore (IIMB) and served as one of the Board of Governors of Indian Institute of Management, Calcutta (IIMC). Ganesh Krishnan so far had four successful entrepreneurship experiences - starting with raising money, putting together a team, scaling and growing across multiple countries and finally successfully monetising through IPO and trade sale - IT&T (acquired by iGate), CustomerAsset (Acquired by ICICI), Marketics (Acquired by WNS) and TutorVista (acquired by Pearson). His specialties are: Starting up, raising capital, incubating ventures , scaling and growing startups.",
        "image": ".\/pages\/public\/img\/alumni and donor photos\/Ganesh Krishna.jpg"
    },
    {
        "serial": "13",
        "branch": "",
        "name": "shiv dass agarwal",
        "class": "",
        "text": "",
        "image": ".\/pages\/public\/img\/alumni and donor photos\/shiv dass agarwal.jpg"
    },
    {
        "serial": "14",
        "branch": "",
        "name": "Praveen Sinha",
        "class": "2001",
        "text": "Praveen is currently the Managing Director of PinCap, an alternative lending platform focused on bridging the debt financing gap for MSMEs. He is currently also the external member of Committee of Startups (CoS) which is part of PSU fund to invest in startups. In his prior role at Jabong as Co- Founder and Managing Director of the company. Praveen’s role encompasses looking after the entire operations capability along with supply chain management, assisted sales, finance, human resources and administration. Jabong was founded in Oct 2011 and Praveen has played a critical leadership role in its phenomenal ramp up. Innovative ideas at various stages and speed of implementation has resulted in establishing Jabong as one of the top most sites in India.<br>Praveen's work in recent times has made him emerge as a focused business leader. Prior to Oct 2011, he has worked with Mckinsey on transformation projects in South East Asia and India. In his time with Maruti, Microsoft, McKinsey and at Jabong he has effected radical transformations in the areas he was involved with. He is considered as a turnaround specialist and expert in energy efficiency and startups. He has worked in different transformation projects across sectors -mines, steel, automotive.",
        "image": ".\/pages\/public\/img\/alumni and donor photos\/Praveen Sinha.jpg"
    },
    {
        "serial": "15",
        "branch": "",
        "name": "Sanjay Gupta",
        "class": "1988",
        "text": "Sanjay Gupta is the Country Head and Vice President of Google India and leads teams that help businesses transform and grow by leveraging digital, with a focus on small and medium enterprises, women entrepreneurs, and start-ups. As a leader, Sanjay is focused on driving key initiatives under Google’s mission in India of making the Internet helpful and safer for a billion Indians and driving efforts to make India a leading digital economy. Sanjay joined Google in early 2020 with a stellar career that spans nearly three decades across the sunrise sectors like media and entertainment, telecom and FMCG industry giving him deep understanding of India’s diverse consumer and business landscape. Before Google, Sanjay was Managing Director of Star and Disney India where he played a pivotal role in extending Star’s traditional television content to digital consumers through Hotstar. He is also widely credited for building their sports business. Sanjay began his career at Hindustan Unilever, where he went onto lead marketing for two of the company's critical segments: Oral and Home care. He then moved to serve as Bharti Airtel’s Chief Marketing Officer for its mobile business, spearheading the growth agenda for the company. In addition to being a founder member of The Nudge\/ Foundation which works in the area of poverty alleviation, Sanjay champions responsible progress for the Internet Industry in India in his capacity as a Chairperson of the Internet & Mobile Association of India (IAMAI). He also actively invests time in mentoring young professionals, startup founders and is part of several advisory committees. Sanjay is a post graduate from the Indian Institute of Management (IIM) Kolkata, and is an engineer from Delhi College of Engineering. Sanjay currently lives in Mumbai.",
        "image": ".\/pages\/public\/img\/alumni and donor photos\/SanjayGupta.jpg"
    },
    {
        "serial": "16",
        "branch": "Electrical Engineering",
        "name": "Suhail Sameer",
        "class": "",
        "text": "Suhail Sameer is the Group President and Chief Executive Officer of BharatPe, India's largest digital payments and micro-credit company for small retailers. Prior, Sameer was the Founding Managing Director of CESC Ventures, where he built out the modern Ayurveda (Dr. Vaidya's) and Healthy snack (Too Yumm!) brands. He was also an Associate Partner at McKinsey & Company where he led the clean-tech practice for Asia. Sameer is an active investor in clean-label food and personal care, and financial inclusion. Some of his angel investments include India's largest clean label personal care brand MamaEarth, farm to table naturoponic brand Gourmet Garden, and India's largest digital secured lending company Rupeek. Sameer is a Niti Aayog Mentor of Change, a government initiative to drive innovation and entrepreneurship, and has been involved with the Rockefeller Foundation’s work on rural electrification in India. He holds an MBA from the Indian Institute of Management and a degree from the Delhi College of Engineering.",
        "image": ".\/pages\/public\/img\/alumni and donor photos\/Suhail Sameer.jpg"
    },
    {
        "serial": "17",
        "branch": "Mechanical Engineering",
        "name": "Pawan Kumar Sharma",
        "class": "1990",
        "text": "Pawan Kumar Sharma perhaps is among the few or may be the only one to have done his graduation, post-graduation and even doctorate from Delhi College of Engineering (DCE). What is even more surprising is that after attaining highest level of education in engineering he went on to join the coveted Indian Administrative Services (IAS)",
        "image": ".\/pages\/public\/img\/alumni and donor photos\/pawan.jpg"
    },
    {
        "serial": "18",
        "branch": "Mechanical Engineering",
        "name": "Prof. V.K. Mahna",
        "class": "1969",
        "text": "Dr Vinod Mahna graduated from Delhi College of Engg in Mech Engg in 1969 and joined DCE as faculty in the year 1972. He later on got his Masters and a Ph.D from IITD after being sponsored on a sabbatical by DCE. He  later on took over as a Professor and Dean in DCE. After DCE shifted to its new campus, Dr. Mahna took over as the founder Principal in the present Indira Gandhi Delhi Technical University for Women in the Kashmere Gate campus. Later on Dr Mahna joined the Union Public Service Commission as its Director and the chief academic resource. Dr Mahna lives in New Delhi and is actively involved in some professional assignments with the Govt of India.",
        "image": ".\/pages\/public\/img\/alumni and donor photos\/Navtez Bal.jpg"
    },
    {
        "serial": "19",
        "branch": "Mechanical Engineering",
        "name": "Dr. Ravi B. Grover",
        "class": "1970",
        "text": "Ravi B. Grover is an Indian nuclear scientist and a mechanical engineer. He is the founding vice-chancellor (during initial years he was designated as director equivalent to vice-chancellor) of the Homi Bhabha National Institute, a member of the Atomic Energy Commission, chairman of the Board of Research in Nuclear Sciences, a fellow of the Indian National Academy of Engineering, and World Academy of Art and Science. He was the president of the Indian Society of Heat and Mass Transfer for the period 2010–2013. He has been awarded Padma Shri by the Government of India in the year 2014. <br> Ravi B. Grover completed his bachelor's degree in mechanical engineering from the prestigious Delhi College of Engineering in 1970 and joined the staff of Bhabha Atomic Research Centre. He completed a PhD in mechanical engineering from the Indian Institute of Science, Bangalore, in 1982. <br> He was awarded Dhirubhai Ambani Oration Award by Indian Institute of Chemical Engineers in 2008, Distinguished Alumnus Award by Delhi College of Engineering Alumni Association in 2009, Distinguished Alumnus Award by Indian Institute of Science and Indian Institute of Science Alumni Association in 2011. In 2016, Delhi college of Engineering Alumni Association bestowed him with a Lifetime Achievement Award.",
        "image": ".\/pages\/public\/img\/new\/ravigrover.jpg"
    }
]