[
    {
        "title": "Sh. D.P. Garg Donated Rs. 50 Lacs towards Scholarships",
        "date": "2025-03-27",
        "serial": "1",
        "info": "N\/A"
    },
    {
        "title": "Sh. Ashok K. Marwah Donated towards Scholarships Rs. 2 Lacs.",
        "date": "2025-01-23",
        "serial": "2",
        "info": "N\/A"
    },
    {
        "title": "Sh. S.B. Lal For Scholarship Rs. 60,000",
        "date": "2025-03-19",
        "serial": "3",
        "info": "N\/A"
    },
    {
        "title": "Sh. Somir Paul Donated towards Scholarships 22,000 dollars",
        "date": "2024-12-16",
        "serial": "4",
        "info": "N\/A"
    },
    {
        "title": "Goswami Family Donated Rs 25 Lacs for establishing the center “Goswami Family Center for Sustainable Materials Research and Education.” at DTU ",
        "date": "2024-08-09",
        "serial": "5",
        "info": "The illustrious Goswami family represented by Sh Lokesh Goswami, Prof Bhuvnesh Goswami, Prof Yogi Goswami , Sh Tushar Goswami and their spouses pledge to contribute Rs 1,00,00,000 \/- ( Rupees One crore) for the establishment of “Goswami Family Center for Sustainable Materials Research and Education.” at DTU. Any member of the Goswami Family may give additional funds over the committed amount in the future. The Goswami brothers are all Alumni of DP\/DCE- Shri Lokesh Goswami (1959), Prof Bhuvnesh Goswami(1959), Prof Yogi Goswami(1969) and Sh Tushar Goswami(1977). The center for Sustainable Materials Research and Education will support research and education in sustainable materials, scholarships for students in sustainable materials and support of materials research laboratories."
    },
    {
        "title": "Sh. Naveen Kukreja Donated Rs 10 Lacs for Scholarships",
        "date": "2024-03-01",
        "serial": "6",
        "info": "“(i) N.C Kukreja and Santosh Kukreja Scholarship, and (ii) Nand Lal Kukreja Scholarship” each with an amount of Rs. 1,00,000\/- per annum shall be awarded each year to two students of 1st year (one scholarship for general category student and another scholarship for backward class student), on Means basis, of any discipline for a period of five years. The students with low family income may be considered, and if there is a tie in the income criteria, then the student with high JEE rank may be considered for award the scholarship."
    },
    {
        "title": "Sh. Ankur Bal Donated Rs. 3 Lacs for Wing Commander Adarsh Bal Scholarship",
        "date": "2024-02-02",
        "serial": "7",
        "info": "\"Wing Commander Adarsh Bal Scholarship” amounting to Rs. 60,000\/- annum shall be awarded to one student on Merit cum Means basis, for Circuit Branches only for 1 st year student who cannot afford to pay for tuition fees, hostel fees, and books etc. the student with low family income may be considered, and if there is a tie in the income criteria, then the student with high JEE rank may be considered to award the scholarship"
    },
    {
        "title": "Dr. Raj Soin, Donated Rs. 20 Lacs Fidelity Investment For Raj Soin Hall",
        "date": "2023-11-30",
        "serial": "8",
        "info": " Dr. Raj Soin (Class 1969,Mechanical engineer). He joined Firestone as industrial engineer and also as the head of Industrial engineering at Williams International. He also started an engineering company, Modern Technologies Corporation, focused on consulting services for US defense department. We grew the company to over four thousand engineers with over forty offices across various countries and serving various agencies and industries His focus has been mainly in health care and education. Some of these have resulted in creation of Sukhdev Raj Soin Hospital in Hodal India; Soin Pediatric Emergency and Trauma center at Dayton Children Hospital; Indu and Raj Soin Medical Center in Dayton; Raj Soin College of Business in Wright State University; Satya Soin Bhartiya Vidaya Mandir in Basoli; Soin Early Childhood School in Dayton: Vishal Soin innovation Park in WSU as some of examples."
    },
    {
        "title": "Sh. Vinod Dham donated $ 1,00,000 For Vinod Dham Center for Semiconductor Research",
        "date": "2023-02-22",
        "serial": "9",
        "info": "Sh. Vinod Dham (Alumnus-1971, Electrical Engineering) Father of Pentium Chip and Venture Capitalist. Better known as Father of the Pentium Chip, Sh. Vinod Dham has Over 40+ years of experience in developing semiconductor products, technologies and Venture Capital. He has been named as one of the top 25 executives in the computer industry and one of the top 100 most influential Asian Americans. Recently, he has been involved in mentoring start-up entrepreneurs, as an Angel Investor. Recently he has been dedicating his efforts to support India Semiconductor Mission - whose goal is to make India Atmanirbhar in Electronics Systems and Chip manufacturing. He has committed Rs, one Crore to start a Vinod Dham Centre for Semiconductor Research in Delhi Technological University."
    },
    {
        "title": "Prof. D. Yogi Goswami and Mrs. Karuna Goswami donated $ 50,000 For Establishment of Energy & Environment Centre at DTU",
        "date": "2022-12-22",
        "serial": "10",
        "info": "Prof. D. Yogi Goswami and Mrs. Karuna Goswami (Class 1969,Mechanical Engineer). Dharendra Yog Goswami, also known as Yogi, went to school in Delhi and graduated from Delhi College of Engineering (DCE) in 1969 with a degree in Mechanical Engineering. He has 3 brothers and 3 sisters. After graduating from DCE, he went to USA and received his MS (1971) and Ph.D (1975) from Auburn University, Auburn, Alabama. Shortly after receiving his Ph.D degree, he decided to go back to India to fulfill a promise he had made to his mother. His journey back to India in 1975 was mostly by road through many countries of Western and Eastern Europe and Asia over a period of 4 months.However, here turned back to USA within a year because of a number of reasons. In January 1977, Yogi started his academic career in USA, teaching and conducting research. At present, he is a Distinguished Professor, which is the highest academic title one can achieve at a University in USA and Director of the Clean Energy Research Center at the University of South Florida Yogi married his wife, Lovely, in December 1977 in New Delhi. They have a son, Dilip and a daughter, Jaya and a grandson, Anjanay. Lovely holds a MSc in Anthropology from Delhi University and also MS in Chemistry from USA. She started a company ATTL, Inc. in 1986 as an environmental laboratory and then developed prototypes of air purification devices based on Yogi’s invention of Photo-electrochemical oxidation (PECO) for disinfection and detoxification of air. Their children, Dilip and Jaya then transformed that business into a successful American company, Molekule, Inc. that manufactures and sells the world’s first molecular air purifier based on Yogi’s invention of PECO. In 2017, Time magazine selected Molekule as one of the 25 best inventions."
    },
    {
        "title": "Dr. Raj Soin donated $ 1,25,640 For Development Of Raj Soin Hall",
        "date": "2022-12-21",
        "serial": "11",
        "info": "Dr. Raj Soin (Class 1969,Mechanical engineer). He joined Firestone as industrial engineer and also as the head of Industrial engineering at Williams International. He also started an engineering company, Modern Technologies Corporation, focused on consulting services for US defense department. We grew the company to over four thousand engineers with over forty offices across various countries and serving various agencies and industries His focus has been mainly in health care and education. Some of these have resulted in creation of Sukhdev Raj Soin Hospital in Hodal India; Soin Pediatric Emergency and Trauma center at Dayton Children Hospital; Indu and Raj Soin Medical Center in Dayton; Raj Soin College of Business in Wright State University; Satya Soin Bhartiya Vidaya Mandir in Basoli; Soin Early Childhood School in Dayton: Vishal Soin innovation Park in WSU as some of examples."
    },
    {
        "title": "Sh. Sat. Prakash Goel donated Rs. 3 Lacs towards betterment of the University",
        "date": "2022-11-14",
        "serial": "12",
        "info": "Sh. Sat. Prakash Goel (Class 1954, Electrical Engineering). he funds donated by Mr. Sat. Prakash Goel (Alumni of batch 1954, Electrical Engineering) will be utilized for any purpose for betterment of the University. The expenditure so sanctioned will be based on the recommendations of the Standing Committee."
    },
    {
        "title": "Sh. Shashi Kishore Jain Goel donated Rs. 1 Lacs towards betterment of the University",
        "date": "2022-10-25",
        "serial": "13",
        "info": "Sh. Shashi Kishore Jain Goel (Class 1971, Electrical Engineering). 1971-72 M\/s BHARAT FOAM UDYOG LTD- PROJECT ENGINEER 1972-86 M\/s DELTON CABLES LTD - PLANT DEV. MANAGER MATERIALS MANAGER FOR ALL GROUP COMPANIES) 1986-2002 M\/s HOTZ INDUSTRIES LTD - GENERAL MANAGER OPERATIONS\/MARKETING 2002-2019 M\/s INOX AIR PRODUCTS PVT LTD - GENERAL MANAGER COMMERCIAL 2019 CURRENT M\/s INOX AIR PRODUCTS PVT LTD - CONSULTANT."
    },
    {
        "title": "Prof. D. Yogi Goswami and Mrs. Karuna Goswami donated $ 25,000 (2nd Installment) For Establishment of Energy & Environment Centre at DTU",
        "date": "2020-01-27",
        "serial": "14",
        "info": "Prof. D. Yogi Goswami and Mrs. Karuna Goswami (Class 1969,Mechanical Engineer). Dharendra Yog Goswami, also known as Yogi, went to school in Delhi and graduated from Delhi College of Engineering (DCE) in 1969 with a degree in Mechanical Engineering. He has 3 brothers and 3 sisters. After graduating from DCE, he went to USA and received his MS (1971) and Ph.D (1975) from Auburn University, Auburn, Alabama. Shortly after receiving his Ph.D degree, he decided to go back to India to fulfill a promise he had made to his mother. His journey back to India in 1975 was mostly by road through many countries of Western and Eastern Europe and Asia over a period of 4 months.However, here turned back to USA within a year because of a number of reasons. In January 1977, Yogi started his academic career in USA, teaching and conducting research. At present, he is a Distinguished Professor, which is the highest academic title one can achieve at a University in USA and Director of the Clean Energy Research Center at the University of South Florida Yogi married his wife, Lovely, in December 1977 in New Delhi. They have a son, Dilip and a daughter, Jaya and a grandson, Anjanay. Lovely holds a MSc in Anthropology from Delhi University and also MS in Chemistry from USA. She started a company ATTL, Inc. in 1986 as an environmental laboratory and then developed prototypes of air purification devices based on Yogi’s invention of Photo-electrochemical oxidation (PECO) for disinfection and detoxification of air. Their children, Dilip and Jaya then transformed that business into a successful American company, Molekule, Inc. that manufactures and sells the world’s first molecular air purifier based on Yogi’s invention of PECO. In 2017, Time magazine selected Molekule as one of the 25 best inventions."
    }
]