[
    {
        "image": ".\/pages\/public\/img\/Class of 1967.jpg",
        "serial": "1",
        "title": "Visit of Prof. Prashant Palvia, PhD Emeritus Professor ",
        "date": "2025 02 18",
        "link": "NA",
        "info": "Visit of Prof. Prashant Palvia, PhD Emeritus Professor and Past Joe Rosenthal Excellence Professor The university of North Carolina Greensboro, USA, visited DTU on 18th February, 2025 "
    },
    {
        "image": ".\/pages\/public\/img/vcraj.JPG",
        "serial": "2",
        "title": "Meeting with 1975 Golden Jubilee Batch",
        "date": "2025 02 17",
        "link": "NA",
        "info": "Meeting with 1975 Golden Jubilee Batch to discuss about the preparation of the Homecoming Meet 2025   "
    },
    {
        "image": ".\/pages\/public\/img/alumni c4.jpeg",
        "serial": "3",
        "title": "Meeting with Shri. Mahesh Joshi, alumnus of 1982 batch. ",
        "date": "2025 02 04",
        "link": "NA",
        "info": "Meeting with Shri. Mahesh Joshi, alumnus of 1982 batch on 4th February, 2025. "
    },
    {
        "image": ".\/pages\/public\/img/Vinod-Dham.jpg",
        "serial": "4",
        "title": "Padma Bhushan Award 2025 to Shri Vinod Dham (Alumnus of 1971 batch)  ",
        "date": "2025",
        "link": "NA",
        "info": "Shri Vinod Dham (Alumnus of 1971 batch) for being honoured with prestigious Padma Bhushan Award 2025 for excellence in Science and Engineering. "
    },
    {
        "image": ".\/pages\/public\/img/alumni c1.jpeg",
        "serial": "5",
        "title": "Signing Ceremony between Shri. Sudhir Sachdeva and DTU",
        "date": "2025 01 14",
        "link": "",
        "info": "Signing Ceremony between Shri. Sudhir Sachdeva, Chairman SGL (Alumnus of DCE) and Delhi Technological University for creating a world- class TRIBOLOGY LAB on 14th January, 2025."
 },
    {
        "image": ".\/pages\/public\/img/Home Coming.JPG",
        "serial": "6",
        "title": "Inauguration of Paytm-DTU Wisdom on Wheels",
        "date": "2025",
        "link": "NA",
        "info": "Inauguration of Paytm-DTU “Wisdom on Wheels”, Shri. Vijay Shekhar Sharma is an alumnus of 1998 batch DCE. His organization Paytm has signed MoU with DTU to establish the testing and training facilities for centre of excellence for electric vehicle and related technologies. Other MoU with DTU has been signed to support for creating a Lab on Wheel facilities for digital literacy in rural area of NCT."
    }
]