[
    {
        "title": "Inauguration of \"Vinod Dham Centre of Excellence for Semiconductors and Microelectronics",
        "date": "2025-04-07",
        "serial": "1",
        "info": "Inauguration of \"Vinod Dham Centre of Excellence for Semiconductors and Microelectronics\" on 7th April, 2025, Chief Guest is Shri. Ashwini Vaishnaw, Hon'ble Minister for Railways, Information & Broadcasting, and Electronics & IT, Government of India. Guest of Honour is Shri. Vinod Dham, Padma Bhushan 2025, Distinguished Alumnus and Father of the Pentium Processor.   Better known as “Father of the Pentium Chip’, Sh. Vinod Dham has over 40+ years of experience in developing semiconductor products, technologies and Venture Capital. He has been named as one of the top 25 executives in the computer industry and one of the top 100 most influential Asian Americans. Recently, he has been involved in mentoring start-up entrepreneurs, as an Angel Investor. He is a founder of IndoUS Venture Partners (IUVP), an India focused early stage venture capital fund. He has pledges to contribute Rs. 1 Crore to DTU towards Vinod Dham Centre of Excellence for Semiconductors and Microelectronics (VDCoE4SM)."
    },
    {
        "title": "Distinguished speaker series - IV, the speaker of the series is Lt. General M U Nair",
        "date": "2025-04-03",
        "serial": "2",
        "info": "The speaker of the Fourth talk of the series is Lt. General M U Nair, PVSM, AVSM SM, Veteran, National Cyber Security Coordinator Government of India on \"Cyber Security Challenges for the Nation\""
    },
    {
        "title": "Distinguished speaker series - III, the speaker of the series is Dr. Arvind Singhal",
        "date": "2025-01-09",
        "serial": "3",
        "info": "The speaker of the Third talk of the series is Dr. Arvind Singhal, Samuel Shirley & Edna Holt Marston Endowed Professor of Communication and Director of the Social Justice Initiative at the University of Texas at El Paso. He also holds courtesy appointments as the William J. Clinton Distinguished Fellow at the Clinton School of Public Service, Little Rock, Arkansas, Distinguished Professor 2, Faculty of Business Administration & Social Sciences, Inland University of Applied Sciences, Norway, and Chancellor’s Honorary Professor, Amity University, India."
    },
    {
        "title": "Distinguished Speaker Series ",
        "date": "2024-10-16",
        "serial": "4",
        "info": "Mahesh Joshi is the speaker for distinguished speaker series lecture on 16th Oct 2024"
    },
    {
        "title": "DTU has initiated a series of talks by distinguished speakers in India, the speaker of the first talk of the series is Padma Shri awardee Dr Ravi Grover, the Indian Nuclear Scientist, and our own Alumnus of 1970 batch, Mechanical Engineering.",
        "date": "2024-08-29",
        "serial": "5",
        "info": "Dr Ravi Grover is well known in India as a proponent of nuclear Energy who played a key role in India’s nuclear program. Ravi B. Grover completed his bachelor's degree in mechanical engineering from the prestigious Delhi College of Engineering in 1970 and joined the Bhabha Atomic Research Centre. He completed a PhD in mechanical engineering from the Indian Institute of Science, Bangalore, in 1982.  He is the founding Director and later on Vice-Chancellor of Homi Bhabha National Institute (HBNI). He played a key role as negotiator in Indo-US nuclear deal in 2007. He received Padma Shri in 2014 in view of his contribution to India’s nuclear program. During a career spanning four decades, Dr. Grover has distinguished himself as an academic, research and development engineer and a science administrator. His knowledge of nuclear engineering and nuclear law has earned him the title 'nuclear diplomat'."
    },
    {
        "title": "Visit of Prof. D. Yogi Goswami on 9th August, 2024 ",
        "date": "2024-08-09",
        "serial": "6",
        "info": "Goswami family has contributed Rs. 25 Lacs towards establishing the center “Goswami Family Center for Sustainable Materials Research and Education.” The center for Sustainable Materials Research and Education will support research and education in sustainable materials, scholarships for students in sustainable materials and support of materials research laboratories."
    },
    {
        "title": "The Scholarship of Rs. 10 Lacs instituted by our distinguished alumnus Shri. Naveen Kukreja, Alumnus of 1999 batch, Electrical Engineering Department.",
        "date": "2024-03-01",
        "serial": "7",
        "info": "Two scholarships namely, “(i) N.C Kukreja and Santosh Kukreja Scholarship, and (ii) Nand Lal Kukreja Scholarship” each with an amount of Rs. 1,00,000\/- per annum shall be awarded each year to two students of 1st year (one scholarship for general category student and another scholarship for backward class student), on Means basis, of any discipline for a period of five years. The students with low family income may be considered, and if there is a tie in the income criteria, then the student with high JEE rank may be considered for award the scholarship"
    },
    {
        "title": "Visit of Shri. Pranav Mehta, Director of Data Science at American Express alumnus of 2011",
        "date": "2024-02-28",
        "serial": "8",
        "info": "An interaction event on “How to Make a career in Data Science\" with Shri. Pranav Mehta, Director of Data Science at American Express alumnus of 2011, on 28th February, 2024 at DTU. The event is for the students of all branches. "
    },
    {
        "title": "The Scholarship of Rs. 3 Lacs instituted by our distinguished alumnus Shri. Ankur Bal, Alumnus of 1999 batch, Electrical Engineering Department.",
        "date": "2024-02-02",
        "serial": "9",
        "info": "“Wing Commander Adarsh Bal Scholarship” amounting to Rs. 60,000\/- annum shall be awarded to one student on Merit cum Means basis, for Circuit Branches only for 1st year student who cannot afford to pay for tuition fees, hostel fees, and books etc. the student with low family income may be considered, and if there is a tie in the income criteria, then the student with high JEE rank may be considered to award the scholarship"
    },
    {
        "title": "5)\tHomecoming Meet 2024",
        "date": "2024-02-02",
        "serial": "10",
        "info": "Diamond, Golden & Silver Jubilee Homecoming Meet- 2022 for DCE graduates (Classes of 1963, 1964, 1973, 1974, 1998 & 1999), a program to felicitate them for their achievements and services to humanity at large presenting before them, different activities related to our alumni held at Delhi Technological University on 02th February, 2024."
    },
    {
        "title": "Visit of DCE-DTU Alumni Association members visited DTU on 15th January, 2024",
        "date": "2024-01-15",
        "serial": "11",
        "info": "Visit of DCE-DTU Alumni Association members visited DTU to explore possible initiatives. "
    },
    {
        "title": " DCE alumnus Professor Prateek Sharma joins DTU as a Vice Chancellor.",
        "date": "2023-11-29",
        "serial": "12",
        "info": "Distinguished alumna\/alumnus Professor Prateek Sharma (Class of 1989, Civil Engineering) assumes the esteemed position of Vice Chancellor at Delhi Technological University (DTU). Faculty and staff engage in heightened enthusiasm, eager to witness the leadership and vision the prof prateek sharma brings. The campus buzzes with a sense of expectation as the university community looks forward to a new chapter marked by innovation and academic excellence."
    },
    {
        "title": "Visit of Sanjeev Ahuja (Alumnus of 1977, Electrical Engineering)",
        "date": "2023-11-21",
        "serial": "13",
        "info": "DCE alumnus Sanjeev Ahuja of 1971, Electrical Engineering visit DTU and amaze to see the progress made by alma matter."
    },
    {
        "title": "Visit of Shri. R.S. Kalsi (Executive Board Member) & Alumnus of 1981",
        "date": "2023-10-12",
        "serial": "14",
        "info": "An Interaction program “Maruti Suzuki 3.0- The Big Indian Automobile Revolution” with Shri. R.S. Kalsi (Executive Board Member) & Alumnus of 1981, was held on 12th October, 2023, for students of all batches."
    },
    {
        "title": "Visit of Shri. Vikram Manuja, (alumnus of 1973, Electrical Engineering)",
        "date": "2023-10-11",
        "serial": "15",
        "info": "An interaction program “Entrepreneurship” with Shri. Vikram Manuja, alumnus of 1973, Electrical Engineering was held on 11th October, 2023"
    },
    {
        "title": "Visit of Shri. Ravinder Paul Singh (Alumnus of 1978 batch, Electrical Engineering)",
        "date": "2023-08-22",
        "serial": "16",
        "info": "An event “Entrepreneurship is a way of life” with Sh. Ravinder Paul Singh (Alumnus of 1978 batch, Electrical Engineering) was held on 22nd August, 2023 for students of Electrical Engineering."
    },
    {
        "title": "Orientation 2023",
        "date": "2023-07-29",
        "serial": "17",
        "info": "An orientation programme for newly admitted undergradcate students was held on 29th July, 2023 at Raj Soin Hall. The chief guest of the programme were our distinguished alumni Sh. Arun Gupta (Alumnus of 2005 batch, Mechanical Engineering).      The major objective of the orientation programme was to make the parents and students aware of the academic aspects of the course, the rules and regulations of the institute and ensuring parental participation in monitoring the performance and progress of students. The major objective of the programme was to make the parents and students aware of the academic aspects of the course, the rules and regulations of the institute and ensuring parental participation in monitoring the performance and progress of students."
    },
    {
        "title": "Interaction with Sh. Mahesh Joshi ",
        "date": "2023-04-20",
        "serial": "18",
        "info": "An interaction program “Carbon Capture” with Sh. Mahesh Joshi (Alumnus of 1982 batch, Mechanical Engineering) was held on 20th April, 2023 for students of Mechanical Engineering. "
    },
    {
        "title": "The Scholarship instituted by our distinguished Alumni:",
        "date": "2023-02-25",
        "serial": "19",
        "info": "Dr. Raj Soin donated $ 125640 (Rs. 1,01,19,383-) 3rd instalment towards Raj Soin Hall.  Prof. D. Yogi Goswami and Mrs. Karuna Goswami donated $ 50,000 (Rs. 40,67,805\/-) 3rd instalment towards Establishment of Energy & Environment Centre at DTU."
    },
    {
        "title": "Visit of Sh. Prem Kumar Asija (Alumnus of 1971, Electrical Engineering) ",
        "date": "2023-03-01",
        "serial": "20",
        "info": "Shri. Prem Kumar Asija, DCE Alumnus of 1971, Electrical (Electronics) Engineering visited DTU on 1st March, 2023 for signing the MoU between DTU and Sh. Prem Kumar Asija towards his donation of Rs. 6,00,000\/- in DTU Medals & Scholarship. "
    }
]