[
    {
        "name": "Office bearer of 1969 Civil Engg. Batch (DCE)",
        "purpose": "Scholarship is awarded to the students of B.Tech (Civil Engg.) on merit-cum-means basis.",
        "amount": "₹ 7,32,000\/-",
        "date": "From 2011 To 2020",
        "serial": 1,
        "image": "\/pages\/public\/img\/alumni and donor photos\/Office bearer of 1969 Civil Engg. Batch (DCE).jpg"
    },
    {
        "serial": 2,
        "name": "Mrs. Inderjeet Kaur Office Secretary (WBO)",
        "purpose": "Grant of Educational Scholarship Scheme (2016-17) “Distribution of Merit Scholarship 2016-17” under the Beti Bachao-Beti Padhao",
        "date": "03.11.2016",
        "amount": "₹ 20,000\/-",
        "image": "\/pages\/public\/img\/alumni and donor photos\/Mrs. Inderjeet Kaur Office Secretary (WBO).jpg"
    },
    {
        "serial": 3,
        "name": "Ms Madhu Jain",
        "purpose": "Pramod Jain Merit Scholarship” is awarded to B.Tech (IT) student based on the academic performance of first four semesters.",
        "date": "05.01.2017",
        "amount": "₹ 3,00,000\/-",
        "image": "\/pages\/public\/img\/alumni and donor photos\/Ms Madhu Jain.jpg"
    },
    {
        "serial": 4,
        "name": "Sh. Rajesh K Mahajan Sh. Mukesh Kumar Goel Sh. Sanjeev Kumar Sh. Vinit Kumar",
        "purpose": "MRSV Award to promote “innovations”. Award comprises of Rs.50,000\/- cash reward for a period of 5 years to B.Tech Elect. Engg. Stream students.",
        "date": "04.02.2017",
        "amount": "₹ 2,50,000\/-",
        "image": "\/pages\/public\/img\/alumni and donor photos\/Sh. Rajesh K Mahajan Sh. Mukesh Kumar Goel Sh. Sanjeev Kumar Sh. Vinit Kumar.jpg"
    },
    {
        "serial": 5,
        "name": "Dr. Durga Das Agrawal",
        "purpose": "Grant for charitable, religious, scientific, literary or educational purposes and to support scholarship for the students on the basis of merit-cum- means to any student of university.",
        "date": "30.6.2017",
        "amount": "$ 10,000 (Rs. 6,46,100)",
        "image": "\/pages\/public\/img\/alumni and donor photos\/Dr. Durga Das Agrawal.jpg"
    },
    {
        "serial": 6,
        "name": "Late Shri Hari Chand Batra (Alumni of erstwhile DCE) & Mrs. Shashi Batra",
        "purpose": "Hari and Shashi Batra Scholarship” is awarded to non-resident (Non Hosteller) female student (s) of B.Tech Elect. Engg. whose family income is less than Rs. 5 lacs per annum. Further, Scholarship is awarded on the basis of highest (CGPA) for first four semesters.",
        "date": "17.10.2017",
        "amount": "₹ 10,00,000",
        "image": "\/pages\/public\/img\/alumni and donor photos\/Late Shri Hari Chand Batra (Alumni of erstwhile DCE) & Mrs. Shashi Batra.jpg"
    },
    {
        "name": "Late Sh. J.L.Pahwa & Mrs.Ashok Pahwa, W\/o Late Sh. J.L. Pahwa",
        "purpose": "Scholarship is awarded on the basis of highest (CGPA) upto 4th semester for 3rd year students of Civil Engg. Deptt",
        "amount": "₹ 3,00,000",
        "date": "17.01.2018",
        "serial": 7,
        "image": "\/pages\/public\/img\/alumni and donor photos\/Late Sh. J.L.Pahwa & Mrs.Ashok Pahwa, W\/o Late Sh. J.L. Pahwa.jpg"
    },
    {
        "name": "Goswami Brothers Alumni Gold Medal",
        "purpose": "Medal\/award is awarded to 2nd & 3rd year student of Polymer Science & Chemical Technology based on academic result as on Feb, 2018",
        "amount": "₹ 2,08,253",
        "date": "Feb, 2018",
        "serial": 8,
        "image": "\/pages\/public\/img\/alumni and donor photos\/Goswami Brothers Alumni Gold Medal.jpg"
    },
    {
        "name": "Office Bearer of Class of 1959 Scholarship (DP Alumni)",
        "purpose": "Class of 1959 Scholarship Scholarship amount to Rs. 50,000\/- per year shall be awarded to two students each of 2nd & 3rd year on the basis of Merit, Need, Social responsibility & Leadership in Science & Technology",
        "amount": "₹ 20,93,969",
        "date": "Feb, 2018",
        "serial": 9,
        "image": "\/pages\/public\/img\/alumni and donor photos\/Office Bearer of Class of 1959 Scholarship (DP Alumni).jpg"
    },
    {
        "serial": 10,
        "name": "Neena Nangia Memorial Award",
        "purpose": "Scholarship is awarded to 2nd year students of Elect. Engg. Deptt. on the basis of merit-cum-means (1st & IInd Sem result) as on Dec, 2018",
        "date": "December, 2018",
        "amount": "₹ 1,83,035",
        "image": "\/pages\/public\/img\/alumni and donor photos\/Neena Nangia.jpg"
    },
    {
        "serial": 11,
        "name": "Gp.Capt. Raghbir Singh Bhola (Retd.)",
        "purpose": "Scholarship of Rs. 15,000\/- annually for 20 years is awarded to a Sports person or someone wanting to do Electrical Engineering and has limited financial means in the name of “Gp. Capt. R.S. Bhola, DTU alumni and Ex-Olympian”",
        "date": "August, 2018",
        "amount": "₹ 3,00,000\/-",
        "image": "\/pages\/public\/img\/alumni and donor photos\/Gp.Capt. Raghbir Singh Bhola (Retd.).jpg"
    },
    {
        "serial": 12,
        "name": "Sh. Suraaj Bhatia",
        "purpose": "Suraj & Prem Bhatia Scholarship Scholarship amount of Rs. 60,000\/- per annum each shall be awarded to 02 female students. (B.Tech Mechanical Engineering)",
        "date": "10-03-2019",
        "amount": "₹ 14,98,913",
        "image": "\/pages\/public\/img\/alumni and donor photos\/Sh. Suraaj Bhatia.jpg"
    },
    {
        "serial": 13,
        "name": "Sh. Santosh Kumar Garg",
        "purpose": "Rajeshwari Garg Memorial Gold Medal Award A medal and a cash award of Rs. 40,000 shall be given to the Girl Topper from 3rd year batch of any. Engg. Branch for 10 years",
        "date": "18-02-2019",
        "amount": "₹ 5 Lac",
        "image": "\/pages\/public\/img\/alumni and donor photos\/Santosh Kumar Garg.jpg"
    },
    {
        "serial": "14",
        "name": "Goswami Brothers Scholarship Shri. Lokesh C. Goswami, Dr. Bhuvenesh C. Goswami, Dr. D. Yogi Goswami, Shri Tushar K. Goswami)",
        "purpose": "Scholarship amount of Rs. 50,000\/- per year shall be awarded to the students either of 2nd or 3rd year on the basis of merit preferably to a ward of Sanskrit School teacher or a school teach or a real needy candidate",
        "date": "23-01-2020",
        "amount": "₹ 5 Lac",
        "image": "\/pages\/public\/img\/alumni and donor photos\/Goswami Brothers Alumni Gold Medal.jpg"
    },
    {
        "name": "Sh. Manmohan Singh Passi",
        "purpose": "Scholarship amounting to INR 60,000\/- per annum each shall be awarded to TWO students (One male and one female) from economically challenged backgrounds of 3rd year in any engineering or computer science discipline based on their academic performance from I to IV semester (At least one of them must be from core Engineering branch).",
        "amount": "$ 10000 (Dollar Ten Thousand Only) (Rs. 7,30,000\/-)",
        "date": "15-12-2020",
        "serial": "15",
        "image": "\/pages\/public\/img\/alumni and donor photos\/Manmohan S. Passi.jpg"
    },
    {
        "name": "Sh. Dheeraj Soni",
        "purpose": "Leela Wati & Mangat Ram Soni Scholarship Scholarship amounting to INR 1,00,000\/- shall be awarded to one student from B.Tech 3rd semester with economically challenged background. All students below the family income of 5 lakh per annum are eligible. In case the applicant pool is larger than one, the student should be chosen on the basis of merit (CGPA upto 2nd semester) with a pre condition that the student has passed in all subjects in 1st and 2nd semesters",
        "amount": "Rs. 5,00,000 (Rs. Five Lac Only)",
        "date": "03-07-2021",
        "serial": "16",
        "image": "\/pages\/public\/img\/alumni and donor photos\/Dr.Hari Jori.jpg"
    },
    {
        "name": "Mr. & Mrs. Laxmi and Raj Mrig",
        "purpose": "Two scholarship amounting to Rs. 60,000\/- per annum each shall be awarded to two female students pursuing engineering degrees preferably in electric power systems\/Electrical Engineering.",
        "amount": "₹ 5,83,070\/-",
        "date": "28.08.2021",
        "serial": "17",
        "image": "\/pages\/public\/img\/alumni and donor photos\/laxmi and raj mrig.jpg"
    },
    {
        "name": "Mr. Arun Gupta and his friends, alumni of 2005 batch of Mechanical Engineering, DCE",
        "purpose": "B.Tech 3rd year Scholarship of Rs. 60,000\/- per annum shall be awarded to the Tech topper girl from 3rd year, across all streams for B.Tech program from university, on merit cum means basis, having CGPA more than 8 upto 4th sem and family income below Rs. 5,00,000\/-. The scholarship is for girls only.",
        "amount": "₹ 3,00,000\/-",
        "date": "02.04.2022",
        "serial": "18",
        "image": "\/pages\/public\/img\/alumni and donor photos\/Arun Gupta.jpg"
    },
    {
        "name": "Sh. Vijay Birbal",
        "purpose": "“Vijay Birbal Gold Medal” for excellence in Engineering. Every year a Medal and a cash of Rs. 40,000\/- shall be awarded to one final year student of Mechanical Engineering based on his\/her academic performance from Ist to VIth semester (purely on merit basis). The award is for 10 years only and not for the life time.",
        "amount": "Rs. 5 Lac",
        "date": "12-12-2022",
        "serial": "19",
        "image": "\/pages\/public\/img\/alumni and donor photos\/Vijay Birbal.jpg"
    },
    {
        "name": "Sh. C.S. Arora",
        "purpose": "Scholarship amounting to Rs. 60,000\/- per annum shall be awarded to a girl student of 1st year B.Tech (Mechanical Engineering) whose parents annual income is minimum out of all the applicants. If more than one girl is eligible on income criterion, then the girl with highest JEE score may be awarded the scholarship.",
        "amount": "Rs. 3 Lac",
        "date": "14-02-2023",
        "serial": "20",
        "image": "\/pages\/public\/img\/alumni and donor photos\/C.S. arora.jpg"
    },
    {
        "name": "Sh. Prem Kumar Asija",
        "purpose": "Scholarship amount of Rs. 3 Lacs, Rs. 60,000\/- per annum shall be awarded on merit cum means basis to one student of Electronics & Communication Engineering based on his\/her academic performance from Ist to VIth semester for a period of five years. Only students with CGPA 8.0 or above.\n\nThe balance amount of Rs. 3 Lacs will be kept in a FD. This is expected to help increase the scholarship amount to Rs. 85,000\/- per annum for the next five years. The selection criteria will be same as for the first five years",
        "amount": "Rs. 6 Lac",
        "date": "01-03-2023",
        "serial": "21",
        "image": "\/pages\/public\/img\/alumni and donor photos\/Prem Kumar.jpg"
    }
]